/*  1.პირობის გაგება
ცადე შენი სიტყვებით ჩამოაყალიბო პირობა~

რა ინფორმაცია შედის ალგორითმში ტექნიკურად და იდეურად? (inputs)

რა ინფორმაცია გამოდის ალგორითმიდან ტექნიკურად და იდეურად? (outputs)

input საკმარისია იმისათვის, რომ გამოვთვალოთ output?
*/

/*    2.input-ის ყველა შესაძლო ვარიანტის დადენა
დაიწყე ყველაზე მარტივით. აშრკარა input-ებით

გაართულე მაგალითები edge case-ებით

რას ვშვებით ცარიელი ან ტექნიკურად არასწორი input-ის მიღების დროს?
*/

//3.დაშალეთ დიდი პრობლემა პატარა პრობლემებად

//საპოვნელია ყველა მარტივი რიცხვი numbers მასივში და გადასაწერია primeNumbers მასივში

//როგორ გავარკვიოთ არის თუ არა კონკრეტული რიცხვი მარტივი?
//(for)საჭიროა გადავირბინოთ numbers მასივზე თითოეული რიცხვის შესამოწმებლად
    //თუ რიცხვი ნაკლებია 2-ზე, ავტმატურად ჩავთვალოთ, რომ ის არაა მარტივი
    //(for)საჭიროა შევქმნათ მასივი primeNumbers სადაც შევინახავთ მარტივ რიცხვებს
    //თუ როცხვი იქნება მარტივი გადავწეროთ ის primeNumbers მასივში

    let numbers = [11,13,20,12,41,91];
    let primeNumbers = [];
    for(let i = 0 ; i < numbers.length ; i++){
        const ricxvi = numbers[i];
        if(ricxvi < 2){
            continue;
        }
        let isPrime = true;
        for(let gamyopi = 2; gamyopi < ricxvi / 2; gamyopi++){
            if(ricxvi % gamyopi == 0){
                isPrime = false;
            }
        }
        if(isPrime){
            primeNumbers[primeNumbers.length] = ricxvi;
        }
    }
    console.log(primeNumbers);